<a href="https://colab.research.google.com/github/Fuenfgeld/ATeamDatenmanagementUndArchivierung/blob/main/Exercise/PandasExercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# import packages
import pandas as pd
import numpy as np

In [ ]:
from numpy.random import randn
np.random.seed(101)

#Exercise1

Consider the following Python dictionary data and Python list labels:

In [ ]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

1. Create a DataFrame df from this dictionary data which has the index labels.
2. Display a summary of the basic information about this DataFrame and its data 
3. Return the first 3 rows of the DataFrame df.
4.Select just the 'animal' and 'age' columns from the DataFrame df.
5.Select the rows where the age is missing, i.e. it is NaN.
6.Select the rows where the animal is a cat and the age is less than 3.
7.Select the rows the age is between 2 and 4 (inclusive).
8.Calculate the mean age for each different animal in df.
9. Count the number of each type of animal in df.
10. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

# Exercise 2

1. Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.
2.Write a Pandas program to split the following given dataframe into groups based on school code and class.

In [ ]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
student_data

   school_code class            name  ... height  weight  address
S1        s001     V  Alberto Franco  ...    173      35  street1
S2        s002     V    Gino Mcneill  ...    192      32  street2
S3        s003    VI     Ryan Parkes  ...    186      33  street3
S4        s001    VI    Eesha Hinton  ...    167      30  street1
S5        s002     V    Gino Mcneill  ...    151      31  street2
S6        s004    VI    David Parkes  ...    159      32  street4

[6 rows x 8 columns]

# Exercise 3

1.   Write a Pandas program to calculate total salary for each person.
2. Write a Pandas program to add a new column to frist datafram and show name of company that of work for each person.

In [ ]:
df_employees_sal = pd.DataFrame({
    'year':[1980,1981,1980,1981,1980,1981,1980,1981],
    'id':[1,1,2,2,3,3,4,4],
    'name':['alice','alice','bob','bob','charlie','charlie','david','david'],
    'salary':[30000,30000,40000,41000,35000,40000,45000,45000],
    'company_id':[1,1,2,2,1,1,2,2]})

df_companies_rev = pd.DataFrame({
    'year':[1980,1981,1980,1981],
    'id':[1,1,2,2],
    'name':['bell labs','bell labs','xerox','xerox'],
    'revenue':[1130000,1130000,5000000,500000]})

In [ ]:
print("DataFrames1:")
print(df_employees_sal)
print("--------------------")
print("DataFrame2")
print(df_companies_rev)

DataFrames1:
   year  id     name  salary  company_id
0  1980   1    alice   30000           1
1  1981   1    alice   30000           1
2  1980   2      bob   40000           2
3  1981   2      bob   41000           2
4  1980   3  charlie   35000           1
5  1981   3  charlie   40000           1
6  1980   4    david   45000           2
7  1981   4    david   45000           2
--------------------
DataFrame2
   year  id       name  revenue
0  1980   1  bell labs  1130000
1  1981   1  bell labs  1130000
2  1980   2      xerox  5000000
3  1981   2      xerox   500000

# Exercise 4

Consider the following dataset:

In [ ]:
from sklearn import datasets
# Load the diabetes dataset
diabetes_X, diabetes_y = datasets.load_diabetes(return_X_y=True)

In [ ]:
type(diabetes_X)

numpy.ndarray

Create a regression model. Solution should be includes:


* spliting data to train and test set,
* training the model
* perdiction 
* saving the model as a pickle file
* exporting results as an excel file